Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྟོང་པ་ཉིད་ཀྱང་ཡང་དག་པའི་མཐའ་ཉིད་དོ།
en: The very limit of reality with respect to all phenomena is indeed emptiness, and emptiness indeed is the very limit of reality.

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཡང་དག་པའི་མཐའ་ལ་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the very limit of reality. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མི་མཁས་པས། བདག་ཏུ་བགྱི་བ་དང་། བདག་གིར་བགྱི་བ་ལ་གནས་པའི་ཡིད་ཀྱིས་གཟུགས་ལ་གནས་ན། དེ་གཟུགས་མངོན་པར་འདུ་བགྱི་བ་ལ་སྤྱོད་ཀྱི།
en: Blessed Lord, if, when bodhisattva great beings practice the perfection of wisdom, owing to their lack of skillful means, they dwell in physical forms with their minds maintaining notions of ‘I’ and ‘mine,’ then they are engaging in the conditioning of physical forms, but they are not practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ། །གལ་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་ན།
en: If they dwell in feelings, perceptions, formative predispositions, and consciousness, then they are engaging in the conditioning of consciousness [and so forth], but they are not practicing the perfection of wisdom.

source: དེ་རྣམ་པར་ཤེས་པ་མངོན་པར་འདུ་བགྱི་བ་ལ་སྤྱོད་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། མངོན་པར་འདུ་བགྱི་བ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་ཟིན་པར་མི་འགྱུར།
en: If one were to ask why, bodhisattva great beings who engage in conditioning do not grasp the perfection of wisdom, and they do not become absorbed in union with the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་ལ་སྙོམས་པར་འཇུག་པར་མི་འགྱུར་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མ་གྱུར་པར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Without perfecting the perfection of wisdom, they will not be emancipated in all-aspect omniscience. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མི་མཁས་པས། བདག་ཏུ་བགྱི་བ་དང་། བདག་གིར་བགྱི་བ་ལ་གནས་པའི་ཡིད་ཀྱིས། ཡང་དག་པའི་མཐའི་བར་ལ་གནས་ན།
en: Blessed Lord, if, when bodhisattva great beings practice the perfection of wisdom, owing to their lack of skillful means, they dwell in [unconditioned phenomena], up to and including the very limit of reality, with their minds maintaining notions of ‘I’ and ‘mine,’ then they are engaging in the conditioning of the very limit of reality [and so forth], but they are not practicing the perfection of wisdom.

source: དེ་ཡང་དག་པའི་མཐའི་མངོན་པར་འདུ་བགྱི་བ་ལ་སྤྱོད་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ།
en: If they dwell in feelings, perceptions, formative predispositions, and consciousness, then they are engaging in the conditioning of consciousness [and so forth], but they are not practicing the perfection of wisdom.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། མངོན་པར་འདུ་བགྱི་བ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་ཟིན་པར་མི་འགྱུར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་ལ་སྙོམས་པར་འཇུག་པར་མི་འགྱུར་ཏེ།
en: If one were to ask why, bodhisattva great beings who engage in conditioning do not grasp the perfection of wisdom, and they do not become absorbed in union with the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མ་གྱུར་པར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Without perfecting the perfection of wisdom, they will not be emancipated in all-aspect omniscience. “

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་འདི་ལྟར་གཟུགས་ནི་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because physical forms cannot be appropriated.

source: གཟུགས་ཀྱི་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་གང་ལགས་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་པའི་སླད་དུ་གཟུགས་མ་ལགས།
en: The nonappropriation of physical forms is not physical forms, on account of the emptiness of its inherent existence.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་སྟེ།
en: Feelings, perceptions, formative predispositions, and consciousness cannot be appropriated.

source: རྣམ་པར་ཤེས་པའི་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་གང་ལགས་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་པའི་སླད་དུ། རྣམ་པར་ཤེས་པ་མ་ལགས།
en: The nonappropriation of consciousness [and so forth] is not consciousness [and so forth], on account of the emptiness of their inherent existence. [

source: ཡང་དག་པའི་མཐའི་བར་དུ་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་སྟེ།
en: Unconditioned phenomena], up to and including the very limit of reality, cannot be appropriated.

source: ཡང་དག་པའི་མཐའི་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་གང་ལགས་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་པའི་སླད་དུ་ཡང་དག་པའི་མཐའ་མ་ལགས་ཏེ།
en: The nonappropriation of the very limit of reality [and other unconditioned phenomena] is not the very limit of reality [and so forth], on account of the emptiness of their inherent existence.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་བའི་སླད་དུ་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་སོ།
en: The perfection of wisdom also cannot be appropriated, on account of the emptiness of its inherent existence. {

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དེ་ལྟར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་དུ་ཡོངས་སུ་བརྟག་པར་བགྱི་སྟེ།
en: Dt.133} “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, they should determine that all phenomena are the emptiness of inherent existence.

source: ཅི་ནས་ཀྱང་ཆོས་གང་ལ་ཡང་ཡིད་རྣམ་པར་མི་རྒྱུ་བ་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བགྱིའོ།
en: They should determine that there is no mental wandering whatsoever, concerning anything at all.

source: །བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་བཟུང་བ་ཞེས་བགྱི་བ་སྟེ། རྒྱ་ཆེ་བ། ཕུལ་དུ་བགྱི་བ། ཚད་མ་མཆིས་པ། ཚད་མ་མཆིས་པར་ངེས་པ། ཉན་ཐོས་དང་།
en: Blessed Lord, this is the bodhisattva great beings’ spacious, perfect, immeasurable, and indeterminate maṇḍala of meditative stability, known as the nonappropriation of all phenomena, which is not misappropriated by or shared in common with any of the śrāvakas and pratyekabuddhas. “

source: རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་ཤིང་། དེ་དག་དང་ཐུན་མོང་མ་ལགས་པ་སྟེ། ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་དེ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་།
en: Bodhisattva great beings who engage in this maṇḍala of meditative stability become emancipated in all-aspect omniscience.

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ།
en: But even this all-aspect omniscience cannot be appropriated, on account of the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of the unlimited, the emptiness of that which has neither beginning nor end, the emptiness of nonexclusion, the emptiness of inherent existence, the emptiness of all phenomena, the emptiness of all intrinsic defining characteristics, the emptiness of nonapprehensibility, the emptiness of nonentities, the emptiness of essential nature, and the emptiness of the essential nature of nonentities.

source: ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་མཚན་མས་བརྗོད་པ་མ་ལགས་པ་སྟེ། དེ་ནི་འདི་ལྟར་མཚན་མ་ལས་ཉོན་མོངས་པ་འབྱུང་སྟེ།
en: If one were to ask why, it is because this [all-aspect omniscience] cannot be expressed by means of distinguishing marks, in that afflicted mental states arise from distinguishing marks. “

source: མཚན་མ་དེ་དག་གང་ཞེ་ན།
en: What, one might ask, constitute those distinguishing marks?

source: གཟུགས་ནི་མཚན་མའོ།
en: Physical forms are distinguishing marks.

source: །ཚོར་བ་ནི་མཚན་མའོ།
en: Feelings are distinguishing marks.

source: །འདུ་ཤེས་ནི་མཚན་མའོ། །འདུ་བྱེད་ནི་མཚན་མའོ།
en: Perceptions are distinguishing marks.

source: །རྣམ་པར་ཤེས་པ་ནི་མཚན་མའོ།
en: Consciousness is a distinguishing mark.

source: །མིག་ནི་མཚན་མའོ།
en: The eyes are distinguishing marks.

source: །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ནི་མཚན་མའོ།
en: The ears, the nose, the tongue, the body, and the mental faculty are distinguishing marks.

source: །གཟུགས་ནི་མཚན་མའོ།
en: Sights are distinguishing marks.

source: །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ནི་མཚན་མའོ།
en: Sounds, odors, tastes, tangibles, and mental phenomena are distinguishing marks.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་ནི་མཚན་མའོ།
en: Visual consciousness is a distinguishing mark.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་མཚན་མའོ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are distinguishing marks.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ནི་མཚན་མའོ།
en: Visually compounded sensory contact is a distinguishing mark.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པདང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ནི་མཚན་མའོ།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are distinguishing marks.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ནི་མཚན་མའོ།
en: Feelings conditioned by visually compounded sensory contact are distinguishing marks.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ནི་མཚན་མའོ།
en: Feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are distinguishing marks.

source: །སའི་ཁམས་ནི་མཚན་མའོ།
en: The earth element is a distinguishing mark.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ནི་མཚན་མའོ།
en: The water element, the fire element, the wind element, the space element, and the consciousness element are distinguishing marks.

source: །མ་རིག་པ་ནི་མཚན་མའོ། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: Fundamental ignorance is a distinguishing mark.

source: མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་།
en: Formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are distinguishing marks.

source: སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་ནི་མཚན་མའོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མཚན་མའོ།
en: The perfection of generosity is a distinguishing mark.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མཚན་མའོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are distinguishing marks.

source: །ནང་སྟོང་པ་ཉིད་ནི་མཚན་མའོ།
en: The emptiness of internal phenomena is a distinguishing mark.

source: །ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ནི་མཚན་མའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་མཚན་མའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་མཚན་མའོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: The emptiness of external phenomena and the emptiness of external and internal phenomena are distinguishing marks. [

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are distinguishing marks.

source: མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: The applications of mindfulness are distinguishing marks.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་མཚན་མའོ།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are all distinguishing marks.

source: །ཡི་གེ་རྣམས་ནི་མཚན་མའོ།
en: Syllables are distinguishing marks.

source: །གཅིག་ཏུ་བརྗོད་པ་ནི་མཚན་མའོ།
en: Singular expressions are distinguishing marks.

source: །གཉིས་སུ་བརྗོད་པ་ནི་མཚན་མའོ།
en: Dual expressions are distinguishing marks.

source: །ཐ་དད་དུ་བརྗོད་པ་ནི་མཚན་མ་སྟེ།
en: Plural expressions are distinguishing marks.

source: དེ་ནི་ཉོན་མོངས་པ་ཞེས་བགྱིའོ།
en: All these are said to be afflictive. {

source: །གལ་ཏེ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་མཚན་མར་བཟུང་བ་ཞིག་ལགས་ན་ནི། ཀུན་དུ་རྒྱུ་བ་ཕྲེང་བ་ཅན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འདི་ལ་དད་པ་ཐོབ་པར་མི་འགྱུར་རོ།
en: Dt.134} “If this perfection of wisdom could be apprehended as a distinguishing mark, the wandering mendicant Śreṇika would indeed not have gained faith in this omniscient wisdom. “

source: །དད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What you may ask, is faith?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡིད་ཆེས་པ་དང་། རྟོག་པ་དང་། མོས་པ་དང་། རྟེན་པ་དང་། སེམས་པ་དང་།
en: It implies conviction, ideation, volition, reliance, attention, appraisal, and scrutiny with respect to the perfection of wisdom— neither through distinguishing marks nor through the absence of distinguishing marks.

source: འཇལ་བ་དང་དཔྱོད་པ་སྟེ། དེ་ཡང་མཚན་མའི་ཚུལ་དུ་མ་ལགས། མཚན་མ་མཆིས་པའི་ཚུལ་དུ་ཡང་མ་ལགས་སོ། །དེ་ལྟར་ན་དེ་ནི་མཚན་མ་དང་མཚན་མ་མཆིས་པ་དང་། ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པས་ཡོངས་སུ་བཟུང་བ་ལགས་ཏེ།
en: Therefore, this [perfection of wisdom] should be appropriated by means of the nonappropriation of distinguishing marks and nondistinguishing marks.

source: ཀུན་ཏུ་རྒྱུ་བ་ཕྲེང་བ་ཅན་དེས་ཀྱང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འདི་ལ་མོས་པར་གྱུར་ནས། དད་པའི་རྗེས་སུ་འབྲང་བས་ཉི་ཚེ་བའི་ཡེ་ཤེས་ཀྱིས་ཞུགས་ཏེ། དེ་ལྟར་ཞུགས་ནས་གཟུགས་ཡོངས་སུ་མ་བཟུང་།
en: The wandering mendicant Śreṇika indeed became a follower [of the Great Vehicle] endowed with faith, owing to the power of his resolution with respect to this omniscient knowledge, and he subsequently entered into it through his own ephemeral knowledge.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མ་བཟུང་ངོ་། །དེ་ནི་འདི་ལྟར་དེས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མ་དམིགས་ཏེ།
en: Having entered into it in that manner, he did not appropriate physical forms, nor did he appropriate feelings, perceptions, formative predispositions, or consciousness, because he did not apprehend any thing, empty of its own defining characteristics, that could be appropriated.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དེས་ཡེ་ཤེས་དེ་རྟོགས་པ་དང་། ཐོབ་པར་བགྱི་བའི་ཚུལ་གྱིས་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: If one were to ask why, it is because he did not observe that knowledge as internally due to the attainment of clear realization.

source: ཡེ་ཤེས་དེ་རྟོགས་པ་དང་། ཐོབ་པར་བགྱི་བའི་ཚུལ་གྱིས་ཕྱི་རོལ་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཡེ་ཤེས་དེ་རྟོགས་པ་དང་། ཐོབ་པར་བགྱི་བའི་ཚུལ་གྱིས་ཕྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: Nor did he observe it as externally due to the attainment of clear realization, and nor did he observe it as externally and internally due to the attainment of clear realization.

source: ཡེ་ཤེས་དེ་རྟོགས་པ་དང་། ཐོབ་པར་བགྱི་བའི་ཚུལ་གྱིས་དེ་ལས་གཞན་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་།
en: Nor did he observe that knowledge as anything else due to the attainment of clear realization. “

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དེས་ཆོས་གང་གིས་རྟོགས་པར་བགྱི་བ་དང་། གང་རྟོགས་པར་བགྱིད་པ་དང་། གང་རྟོགས་པར་བགྱི་བ་དེ་ལྟ་བུའི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ།
en: If one were to ask why, it is because he did not observe anything that could engender that realization, any realization that could be engendered, or anything from which that realization could be engendered.

source: དེས་ཡེ་ཤེས་དེ་གཟུགས་ཀྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཡེ་ཤེས་དེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not observe that knowledge to be inside physical forms, nor did he observe that knowledge to be inside feelings, perceptions, formative predispositions, or consciousness.

source: ཡེ་ཤེས་དེ་གཟུགས་ཀྱི་ཕྱི་རོལ་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཡེ་ཤེས་དེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཕྱི་རོལ་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not observe that knowledge to be outside physical forms, nor did he observe that knowledge to be outside feelings, perceptions, formative predispositions, or consciousness.

source: ཡེ་ཤེས་དེ་གཟུགས་ཀྱི་ཕྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཡེ་ཤེས་དེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཕྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not observe that knowledge to be outside and inside physical forms, nor did he observe that knowledge to be outside and inside feelings, perceptions, formative predispositions, or consciousness.

source: ཡེ་ཤེས་དེ་གཟུགས་མ་ལགས་པ་གཞན་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཡེ་ཤེས་དེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མ་ལགས་པ་གཞན་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not observe that knowledge to be anything other than physical forms, nor did he observe that knowledge to be anything other than feelings, perceptions, formative predispositions, and consciousness.

source: ཡེ་ཤེས་དེ་ཡང་དག་པའི་མཐའི་བར་གྱི་ནང་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not observe that knowledge to be inside [unconditioned phenomena], up to and including the very limit of reality.

source: ཡེ་ཤེས་དེ་ཡང་དག་པའི་མཐའི་ཕྱི་རོལ་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not observe that knowledge to be outside [unconditioned phenomena], up to and including the very limit of reality.

source: ཡེ་ཤེས་དེ་ཡང་དག་པའི་མཐའི་ཕྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: He did not observe that knowledge to be outside and inside [unconditioned phenomena], up to and including the very limit of reality.

source: ཡེ་ཤེས་དེ་ཡང་དག་པའི་མཐའ་མ་ལགས་པ་གཞན་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་།
en: He did not observe that knowledge to be anything other than [unconditioned phenomena], up to and including the very limit of reality.

source: །རྣམ་གྲངས་འདི་ལ་ཀུན་ཏུ་རྒྱུ་བ་ཕྲེང་བ་ཅན་མོས་པར་གྱུར་ཏེ། དེ་ལྟར་མོས་པར་གྱུར་ན། དད་པའི་རྗེས་སུ་འབྲང་བས་ཆོས་ཉིད་ཚད་མར་བགྱིས་ཏེ། ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་སླད་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་ཞུགས་པར་གྱུར་ཏེ། དེ་དེ་ལྟར་མོས་པར་གྱུར་ནས།
en: This formulation explains how the wandering mendicant Śreṇika, after making this resolution, entered as a follower endowed with faith into the knowledge of all-aspect omniscience since he did not apprehend anything at all, taking reality as his standard.

source: དེས་ཆོས་གང་ཡང་མཚན་མ་མཆིས་པ་དང་། ཡིད་ལ་བགྱི་བ་མ་མཆིས་པའི་སླད་དུ་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་ཏེ།
en: Having made that resolution, he did not appropriate anything at all because he was without distinguishing marks and focused no attention on them.

source: ཆོས་ཐམས་ཅད་གཟུང་དུ་མ་མཆིས། གཏང་དུ་མ་མཆིས་པའི་སླད་དུ། ཡོངས་སུ་གཟུང་བར་བགྱི་བའམ། གཏང་བར་བགྱི་བ་དེ་ལྟ་བུའི་ཆོས་གང་ཡང་དེས་མ་དམིགས་ཏེ། ཆོས་ཐམས་ཅད་ལ་རློམ་སེམས་མ་མཆིས་པའི་སླད་དུ།
en: Inasmuch as all phenomena cannot be grasped and cannot be relinquished, he did not apprehend anything that he might have grasped or anything that he might have relinquished.

source: དེ་ནི་མྱ་ངན་ལས་འདས་པས་ཀྱང་རློམ་སེམས་སུ་འགྱུར་བ་མ་མཆིས་སོ།
en: Since he did not give rise to conceits about anything, {Dt.135} he did not give rise to conceits even on the basis of nirvāṇa. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་གང་ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའི་སླད་དུ། གཟུགས་ཡོངས་སུ་མི་འཛིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མི་འཛིན་པ་དང་། ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའི་སླད་དུ། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: Blessed Lord, owing to the nonappropriation of all phenomena, [bodhisattvas] do not grasp physical forms, and they do not grasp feelings, perceptions, formative predispositions, or consciousness.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། མངོན་པར་འདུ་བགྱི་བ་མ་མཆིས་པ་དང་། དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་།
en: Owing to the nonappropriation of all phenomena, they do not grasp the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas, or unconditioned phenomena, the real nature, reality, the realm of phenomena, the abiding nature of all phenomena, the maturity of all phenomena, or the very limit of reality.

source: ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ཡོངས་སུ་མི་འཛིན་པ་འདི་ནི་ཕ་རོལ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This is indeed the perfection of bodhisattva great beings because it is the perfection that cannot be transcended. “

source: །འོན་ཀྱང་སྨོན་ལམ་ཡོངས་སུ་མ་རྫོགས་ཀྱི་བར་དུ་བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡོངས་སུ་མ་རྫོགས། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་།
en: However, as long as their aspirations have not been fulfilled, they will not pass into final nirvāṇa prematurely.
